{
	"_GeneralInformation":{
    "ShortName": "FEMA P-58 2nd Edition",
    "Description": "The models in this dataset are based on the 2nd edition of FEMA P-58. Speecifically, the parameters are parsed from the FEMAP-58_FragilityDatabase_v3.1.2.xls file that is published as part of Volume 3 of the methodology. A few obvious typos and errors have been fixed in that file; these adjustments are captured in the changelog here: <URL>. Simultaneous damage states have been replaced with equivalent Mutually exclusive damage states. Component classification is based on UNIFORMAT II as per NISTIR 6389.",
    "Version": "1.0",
    "ComponentGroups": {
      "B - Shell": {
        "B.10 - Super Structure":         	
        [
          "B.10.31 - Steel Columns",
          "B.10.33 - Steel Braces",
          "B.10.35 - Steel Connections",
          "B.10.41 - RC or Composite Columns",
          "B.10.42 - RC or Composite Beams",
          "B.10.44 - RC or Composite Shearwalls",
          "B.10.49 - RC Flat Slabs",
          "B.10.51 - Ordinary Reinforced Masonry Walls",
          "B.10.52 - Special Reinforced Masonry Walls",
          "B.10.61 - Cold-formed Steel Walls",
          "B.10.71 - Wood Light Frame"
        ],
        "B.20 - Exterior Enclosure": [
          "B.20.11 - Exterior Walls",
          "B.20.22 - Curtain Walls",
          "B.20.23 - Storefronts"
        ],
        "B.30 - Roofing": [
          "B.30.11 - Roof Coverings",
          "B.30.31 - Masonry Chimney",
          "B.30.41 - Masonry Parapet"
        ]
      },
      "C - Interiors": {
        "C.10 - Interior Construction": [
          "C.10.11 - Partitions"
        ],
        "C.20 - Stairs": [
          "C.20.11 - Stair Construction"
        ],
        "C.30 - Interior Finishes": [
          "C.30.11 - Wall Finishes",
          "C.30.21 - Floor Finishes",
          "C.30.27 - Access Pedastal Flooring",
          "C.30.32 - Ceiling Finishes",
          "C.30.34 - Independent Pendant Lighting"
        ]
      },
      "D - Services": {
        "D.10 - Conveying": [
          "D.10.14 - Elevators & Lifts"
        ],
        "D.20 - Plumbing": [
          "D.20.21 - Domestic Water Distribution - Cold Water",
          "D.20.22 - Domestic Water Distribution - Hot Water",
          "D.20.31 - Sanitary Waste",
          "D.20.51 - Chilled Water Distribution",
          "D.20.61 - Steam Distribution"
        ],
        "D.30 - HVAC": [
          "D.30.31 - Cooling Generating Systems - Chilled Water",
          "D.30.32 - Cooling Generating Systems - Direct Expansion",
          "D.30.41 - Air Distribution Systems",
          "D.30.52 - Terminal & Package Units",
          "D.30.67 - Controls and Instrumentation"
        ],
        "D.40 - Fire Protection": [
          "D.40.11 - Sprinklers"
        ],
        "D.50 - Electrical": [
          "D.50.11 - Electrical Service & Distribution - High Tension",
          "D.50.12 - Electrical Service & Distribution - Low Tension",
          "D.50.92 - Other Electrical Systems"
        ]
      },
      "E - Equipments and furnishings": {
        "E.20 - Furnishings": [
        	"E.20.22 - Movable Furnishings"
        ]
      },
      "F - Special Construction & Demolition": {
        "F.10 - Special Construction": [
        	"F.10.12 - Special Structures"
        ]
      }
    },
    "DecisionVariables":{
      "Cost": "Repair costs include consideration of all necessary construction activities to return the damaged components to their pre-earthquake condition. Repair actions assume repair or replacement “in-kind,” and do not include work associated with bringing a non-conforming installation or structure into compliance with newer criteria. Repair costs are based on the repair measures outlined for each damage state, and include all the steps a contractor would implement to conduct a repair including: Removal or protection of contents adjacent to the damaged area; Shoring of the surrounding structure (if necessary); Protection of the surrounding area (e.g., from dust and noise) with a temporary enclosure ; Removal of architectural and mechanical, electrical, and plumbing systems, as necessary, to obtain access for the repair; Procurement of new materials and transport to the site ; Conduct of the repair work ; Replacement of architectural and mechanical, electrical, and plumbing systems, as necessary ; Clean-up and replacement of contents.\nConsequence functions for repair costs provided with the methodology were developed based on construction cost estimates computed for a reference location in the United States (Northern California) at a reference time (2011), neglecting uncertainty in contractor pricing strategies or construction cost escalation. Repair cost consequences include consideration of economies of scale and efficiencies in construction operations. When a large quantity of the same type of work is necessary, contractor mobilization, demobilization, and overhead costs can be spread over a larger volume of work, resulting in reduced unit rates. At each point along the consequence function, there is a distribution of potential repair costs. The distribution (and dispersion) was derived from cost data representing 10th, 50th, and 90th percentile estimates of construction cost. Both lognormal and normal distributions were developed from available repair cost data, and the curve with the best fit was used in each case.",
      "Time": "The actual time that a building will be unusable for beneficial re-occupancy following an earthquake is difficult to determine. To estimate repair time, each damage state includes a time-related consequence function that indicates the number of labor hours associated with the specified repair actions. A key parameter for developing repair time estimates is the number of workers assumed to occupy the building at the same time. The methodology uses a “maximum worker per square foot” parameter that can be adjusted to account for whether or not the building is occupied during construction, as well as assumptions about the availability of contractor labor in the region.\nRepair time consequences also include consideration of economies of scale and efficiencies in construction operations. Since the detailed repair time estimate was derived from the repair cost data, the final repair time distribution and dispersion were based on the repair cost results. Repair cost dispersion are enriched by 0.25 to account for the additional uncertainty associated with estimating repair time for a given repair scenario.\nSerial repair strategies assume work occurs sequentially between floors. Parallel repair strategies assume work occurs on all floors simultaneously. Repair time estimates shall include consideration of both serial and parallel repair strategies. Neither strategy is likely to represent the actual schedule used to repair a particular building, but the two extremes are expected to represent a reasonable bound to the probable repair time.\nRepair time can be significantly affected by long lead times for procurement of critical equipment and components (e.g., HVAC equipment and elevators). Because lead times vary, and are case-specific, they are not explicitly provided as part of the methodology. If a damage requires replacement of a component that is associated with a long lead time, this is indicated in the consequence specification.",
      "Carbon": "Captures contributions to climate change potential by greenhouse gas emissions converted to equivalent CO2.\nEnvironmental impacts are calculated directly from the repair cost estimates with the generalized EIO impact per dollar spent in each industrial sector, multiplied by the repair costs in each of these sectors. Thus, the level of precision parallels the level of precision in the repair cost estimate. The environmental impact of manufacturing building materials and products is considered. The impacts of other life cycle stages (transportation, construction, use, and end of life) are not included at this time due to limitations of the available data. Construction repair cost estimates are divided into industrial sectors including labor, material manufacturing, equipment rental and energy use. The evaluation assumes zero environmental impact of labor (as is common in LCA) and equipment rental (assuming impact of equipment distributed over many uses).\nThe range and uncertainty of environmental impacts are estimated to match the range and uncertainty in the repair costs. The dispersion in embodied carbon and embodied energy is assumed to be directly related to that for repair cost, and is computed for each of these impacts by enriching the dispersion from repair costs by 0.25.",
      "Energy": "Captures primary energy used in material production and transportation.\nEnvironmental impacts are calculated directly from the repair cost estimates with the generalized EIO impact per dollar spent in each industrial sector, multiplied by the repair costs in each of these sectors. Thus, the level of precision parallels the level of precision in the repair cost estimate. The environmental impact of manufacturing building materials and products is considered. The impacts of other life cycle stages (transportation, construction, use, and end of life) are not included at this time due to limitations of the available data. Construction repair cost estimates are divided into industrial sectors including labor, material manufacturing, equipment rental and energy use. The evaluation assumes zero environmental impact of labor (as is common in LCA) and equipment rental (assuming impact of equipment distributed over many uses).\nThe range and uncertainty of environmental impacts are estimated to match the range and uncertainty in the repair costs. The dispersion in embodied carbon and embodied energy is assumed to be directly related to that for repair cost, and is computed for each of these impacts by enriching the dispersion from repair costs by 0.25."
    }
  }
}